[
{"code": "CS100", "title": "Introduction to the Profession", "link": "http://bulletin.iit.edu/search/?P=CS%20100", "description": "An introduction to science and engineering as a profession. Examines the problem-solving process used in engineering and science. Emphasizes the interdisciplinary and international nature of problem-solving and the need to evaluate solutions in terms of a variety of constraints: computational, financial, and social.", "credits": " 2", "prerequisites:": []},
{"code": "CS104", "title": "Introduction to Computer Programming for Engineers", "link": "http://bulletin.iit.edu/search/?P=CS%20104", "description": "Introduces the use of high-level programming language as a problem-solving tool in engineering including basic data structures and algorithms, structured programming techniques, and software documentation.  Designed for students who have had little or no prior experience with computer programming.  Students should only take one of these courses (", "credits": " 2", "prerequisites:": []},
{"code": "CS105", "title": "Introduction to Computer Programming", "link": "http://bulletin.iit.edu/search/?P=CS%20105", "description": "Introduces the use of high-level programming language as a problem-solving tool, including basic data structures and algorithms, structured programming techniques, and software documentation. Designed for students who have had little or no prior experience with computer programming.  Students should only take one of these courses (", "credits": " 2", "prerequisites:": []},
{"code": "CS110", "title": "Computing Principles", "link": "http://bulletin.iit.edu/search/?P=CS%20110", "description": "An introduction to the following \"big ideas\" of computer science:  (1) computing is a creative activity; (2) abstraction reduces information and detail to facilitate focus on relevant concepts; (3) data and information facilitate the creation of knowledge; (4) algorithms are used to develop and express solutions to computational problems; (5) programming enables problem solving, human expression, and creation of knowledge; (6) the internet pervades modern computing; and  (7) computing has global impacts.", "credits": " 2", "prerequisites:": []},
{"code": "CS115", "title": "Object-Oriented Programming I", "link": "http://bulletin.iit.edu/search/?P=CS%20115", "description": "Introduces the use of a high-level object-oriented programming language as a problem-solving tool, including basic data structures and algorithms, object-oriented programming techniques, and software documentation. Designed for students who have had little or no prior experience with computer programming. For students in CS and CS-related degree programs.  Students should only take one of these courses (", "credits": " 2", "prerequisites:": []},
{"code": "CS116", "title": "Object-Oriented Programming II", "link": "http://bulletin.iit.edu/search/?P=CS%20116", "description": " Introduces more advanced elements of object-oriented programming, including dynamic data structures, recursion, searching and sorting, and advanced object-oriented programming techniques. For students in CS and CS-related degree programs.", "credits": " 2", "prerequisites:": ["CS115", "CS115"]},
{"code": "CS201", "title": "Accelerated Introduction to Computer Science", "link": "http://bulletin.iit.edu/search/?P=CS%20201", "description": "Problem-solving and design using an object-oriented programming language. Introduces a variety of problem-solving techniques, algorithms, and data structures in object-oriented programming.", "credits": " 4", "prerequisites:": ["CS104", "CS105", "CS110", "CS115", "CS104", "CS105", "CS110", "CS115"]},
{"code": "CS330", "title": "Discrete Structures", "link": "http://bulletin.iit.edu/search/?P=CS%20330", "description": "Introduction to the use of formal mathematical structures to represent problems and computational processes. Topics covered include Boolean algebra, first-order logic, recursive structures, graphs, and abstract language models. Credit will not be granted for both ", "credits": " 3", "prerequisites:": ["CS201", "CS116", "CS201", "CS116"]},
{"code": "CS331", "title": "Data Structures and Algorithms", "link": "http://bulletin.iit.edu/search/?P=CS%20331", "description": "Implementation and application of the essential data structures used in computer science. Analysis of basic sorting and searching algorithms and their relationship to these data structures. Particular emphasis is given to the use of object-oriented design and data abstraction in the creation and application of data structures.", "credits": " 3", "prerequisites:": ["CS116", "CS201", "CS116", "CS201"]},
{"code": "CS340", "title": "Programming Paradigms and Patterns", "link": "http://bulletin.iit.edu/search/?P=CS%20340", "description": "This class balances the imperative, object-oriented bent of the introductory programming sequence by presenting alternative programming paradigms and asks students to write complex programs from scratch while amassing a repertoire of reusable programming patterns and techniques.  Programming assignments, drawn from various domains of computer science, will highlight the importance of selecting appropriate data structures, algorithms, and techniques for the problem at hand.", "credits": " 3", "prerequisites:": ["CS116", "CS201", "CS116", "CS201"]},
{"code": "CS350", "title": "Computer Organization and Assembly Language Programming", "link": "http://bulletin.iit.edu/search/?P=CS%20350", "description": "Introduction to the internal architecture of computer systems, including micro-, mini-, and mainframe computer architectures. Focuses on the relationship among a computer's hardware, its native instruction set, and the implementation of high-level languages on that machine. Uses a set of assembly language programming exercises to explore and analyze a microcomputer architecture. Credit will not be granted for both ", "credits": " 3", "prerequisites:": ["CS116", "CS201", "CS116", "CS201"]},
{"code": "CS351", "title": "Systems Programming", "link": "http://bulletin.iit.edu/search/?P=CS%20351", "description": "Examines the components of sophisticated multilayer software systems, including device drivers, systems software, applications interfaces, and user interfaces. Explores the design and development of interrupt-driven and event-driven software.", "credits": " 3", "prerequisites:": ["CS331", "CS350", "CS331", "CS242", "CS331", "CS350", "CS331", "CS242"]},
{"code": "CS401", "title": "Introduction to Advanced Studies I", "link": "http://bulletin.iit.edu/search/?P=CS%20401", "description": "First course in a two-course sequence that is designed to prepare students for graduate study in computer science.  Explores the implementation and application of fundamental data structures and algorithms with an emphasis on object-oriented programming in Java.  Examines the relationship between these elements and the mathematical structures that form the foundation of computer science.  This course does not apply toward M. S./Ph. D. credit in Computer Science.", "credits": " 3", "prerequisites:": ["CS201", "CS201"]},
{"code": "CS402", "title": "Introduction to Advanced Studies II", "link": "http://bulletin.iit.edu/search/?P=CS%20402", "description": "Second course in a two-course sequence that is designed to prepare students for graduate study in computer science. Explores the development of the multiple layers of software that form a sophisticated software system, from device drivers to application interfaces to user interfaces. Examines how computer architecture influences software development. Emphasizes the design and implementation of interrupt-driven/event-driven software.", "credits": " 3", "prerequisites:": ["CS401", "CS401"]},
{"code": "CS403", "title": "Foundations to Advanced Studies", "link": "http://bulletin.iit.edu/search/?P=CS%20403", "description": "This course is a six-credit hour integration of ", "credits": " 6", "prerequisites:": []},
{"code": "CS406", "title": "Introduction to Discrete Structures and Algorithms", "link": "http://bulletin.iit.edu/search/?P=CS%20406", "description": "This course will provide students with an understanding of some basic discrete mathematics and techniques for designing computer algorithms and measuring and analyzing their behavior. We emphasize the necessary mathematical ideas such as how to prove a mathematical statement, how to analyze the worst case and the average case complexity of an algorithm. We also introduce students to some new techniques used in designing algorithms, such as the approximation algorithms and randomized algorithms.", "credits": " 3", "prerequisites:": []},
{"code": "CS411", "title": "Computer Graphics", "link": "http://bulletin.iit.edu/search/?P=CS%20411", "description": "Overview of display devices and applications. Vector graphics in two and three dimensions. Image generation, representation, and manipulation. Homogeneous coordinates. Modeling and hidden line elimination. Introduction to raster graphics. Perspective and parallel projections.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS403", "CS331", "CS401", "CS403"]},
{"code": "CS422", "title": "Data Mining", "link": "http://bulletin.iit.edu/search/?P=CS%20422", "description": "This course will provide an introductory look at concepts and techniques in the field of data mining. After covering the introduction and terminologies to Data Mining, the techniques used to explore the large quantities of data for the discovery of meaningful rules and knowledge such as market basket analysis, nearest neighbor, decision trees, and clustering are covered. The students learn the material by implementing different techniques throughout the semester.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS403", "CS331", "CS401", "CS403"]},
{"code": "CS425", "title": "Database Organization", "link": "http://bulletin.iit.edu/search/?P=CS%20425", "description": "Overview of database architectures, including the Relational, Hierarchical, Network, and Object Models. Database interfaces, including the SQL query language. Database design using the Entity-Relationship Model. Issues such as security, integrity, and query optimization.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS403", "CS331", "CS401", "CS403"]},
{"code": "CS429", "title": "Information Retrieval", "link": "http://bulletin.iit.edu/search/?P=CS%20429", "description": "Overview of fundamental issues of information retrieval with theoretical foundations. The information-retrieval techniques and theory, covering both effectiveness and run-time performance of information-retrieval systems are covered. The focus is on algorithms and heuristics used to find documents relevant to the user request and to find them fast. The course covers the architecture and components of the search engine such as parser, stemmer, index builder, and query processor. The students learn the material by building a prototype of such a search engine. Requires strong programming knowledge.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS331", "CS401"]},
{"code": "CS430", "title": "Introduction to Algorithms", "link": "http://bulletin.iit.edu/search/?P=CS%20430", "description": "Introduction to the design, behavior, and analysis of computer algorithms. Searching, sorting, and combinatorial algorithms are emphasized. Worst case, amortized, and expected bounds on time and space usage.", "credits": " 3", "prerequisites:": ["CS331", "CS330", "CS331", "CS230", "CS401", "CS403", "CS331", "CS330", "CS331", "CS230", "CS401", "CS403"]},
{"code": "CS440", "title": "Programming Languages and Translators", "link": "http://bulletin.iit.edu/search/?P=CS%20440", "description": "Study of commonly used computer programming languages with an emphasis on precision of definition and facility in use. Scanning, parsing, and introduction to compiler design. Use of compiler generating tools.", "credits": " 3", "prerequisites:": ["CS330", "CS331", "CS230", "CS331", "CS401", "CS403", "CS330", "CS331", "CS230", "CS331", "CS401", "CS403"]},
{"code": "CS442", "title": "Mobile Applications Development", "link": "http://bulletin.iit.edu/search/?P=CS%20442", "description": "Students will learn a variety of software engineering techniques and design patterns to assist in the rapid development and prototyping of applications, leveraging frameworks and APIs provided by current mobile development platforms (such as Android and iOS).  Application lifecycles, data management and persistence mechanisms, and user interface design, among other topics, will be covered.  Industry speakers will be invited to speak about best practices.  Students (individually or in teams) will take ideas from concept to final implementation and will present their work at the end of the semester.  When appropriate, students may take the additional step of deploying their work on the appropriate application marketplace(s).", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS351", "CS402", "CS331", "CS401", "CS351", "CS402"]},
{"code": "CS443", "title": "Compiler Construction", "link": "http://bulletin.iit.edu/search/?P=CS%20443", "description": "This course covers the design and implementation of a compiler for modern languages by implementing the following:  abstract syntax trees; intermediate representations; static analysis; fix-point operations; symbol tables and type checking; and first-order and high-order function implementation.  Students will incrementally create a series of compilers.", "credits": " 3", "prerequisites:": ["CS440", "CS440"]},
{"code": "CS445", "title": "Object Oriented Design and Programming", "link": "http://bulletin.iit.edu/search/?P=CS%20445", "description": "Introduction to methodologies for object-oriented design and programming. Examines the object model and how it is realized in various object-oriented languages. Focuses on methods for developing and implementing object-oriented systems.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS403", "CS331", "CS401", "CS403"]},
{"code": "CS447", "title": "Distributed Objects", "link": "http://bulletin.iit.edu/search/?P=CS%20447", "description": "This course provides an introduction to architecture, analysis, design, and implementation of distributed, multi-tier applications using distributed object technology. The course focuses on the services and facilities provided by an Object Request Broker (ORB). Students will use a commercially available ORB and Database Management System to develop distributed object applications.", "credits": " 3", "prerequisites:": []},
{"code": "CS450", "title": "Operating Systems", "link": "http://bulletin.iit.edu/search/?P=CS%20450", "description": "Introduction to operating system concepts-including system organization for uniprocessors and multiprocessors, scheduling algorithms, process management, deadlocks, paging and segmentation, files and protection, and process coordination and communication.", "credits": " 3", "prerequisites:": ["CS351", "CS401", "CS402", "CS403", "CS351", "CS401", "CS402", "CS403"]},
{"code": "CS451", "title": "Introduction to Parallel and Distributed Computing", "link": "http://bulletin.iit.edu/search/?P=CS%20451", "description": "This course covers general introductory concepts in the design and implementation of parallel and distributed systems covering all the major branches such as cloud computing, grid computing, cluster computing, supercomputing, and many-core computing.", "credits": " 3", "prerequisites:": ["CS351", "CS450", "CS351", "CS450"]},
{"code": "CS455", "title": "Data Communications", "link": "http://bulletin.iit.edu/search/?P=CS%20455", "description": "Introduction to data communication concepts and facilities with an emphasis on protocols and interface specifications. Focuses on the lower four layers of the ISO-OSI reference model.", "credits": " 3", "prerequisites:": ["CS450", "CS450"]},
{"code": "CS456", "title": "Introduction to Wireless Networks and Performance", "link": "http://bulletin.iit.edu/search/?P=CS%20456", "description": "This class provides an opportunity for students to obtain a fundamental understanding of the nature and operation of the full range of wireless networks (personal, local area, wide area, and satellite) and their performance characteristics, future potential, and challenges through class lectures, assigned readings, homework, projects, and various hands-on experiences.", "credits": " 3", "prerequisites:": ["CS350", "CS242", "CS401", "CS402", "CS403", "CS350", "CS242", "CS401", "CS402", "CS403"]},
{"code": "CS458", "title": "Introduction to Information Security", "link": "http://bulletin.iit.edu/search/?P=CS%20458", "description": "An introduction to the fundamentals of computer and information security. This course focuses on algorithms and techniques used to defend against malicious software. Topics include an introduction to encryption systems, operating system security, database security, network security, system threats, and risk avoidance procedures.", "credits": " 3", "prerequisites:": ["CS425", "CS450", "CS455", "CS425", "CS450", "CS455"]},
{"code": "CS470", "title": "Computer Architecture", "link": "http://bulletin.iit.edu/search/?P=CS%20470", "description": "Introduction to the functional elements and structures of digital computers. Detailed study of specific machines at the register transfer level illustrates arithmetic, memory, I/O and instruction processing.", "credits": " 3", "prerequisites:": ["CS350", "CS242", "CS350", "CS242"]},
{"code": "CS480", "title": "Introduction to Artificial Intelligence", "link": "http://bulletin.iit.edu/search/?P=CS%20480", "description": "Introduction to computational methods for intelligent control of autonomous agents, and the use of programming paradigms that support development of flexible and reactive systems. These include heuristic search, knowledge representation, constraint satisfaction, probabilistic reasoning, decision-theoretic control, and sensor interpretation. Particular focus will be places on real-world application of the material.", "credits": " 3", "prerequisites:": ["CS331", "CS474", "CS401", "CS402", "CS331", "CS475", "CS331", "CS474", "CS401", "CS402", "CS331", "CS475"]},
{"code": "CS481", "title": "Artificial Intelligence Language Understanding", "link": "http://bulletin.iit.edu/search/?P=CS%20481", "description": "Theory and programming paradigms that enable systems to understand human language texts and extract useful information and knowledge. For example, extraction of structured event representations from news stories or discovering new research hypotheses by analyzing thousands of medical research articles. the course covers a variety of text analysis and text mining methods, with an emphasis on building working systems. Connections to information retrieval, data mining, and speech recognition will be discussed.", "credits": " 3", "prerequisites:": ["CS475", "CS331", "CS474", "CS331", "CS402", "CS401", "CS475", "CS331", "CS474", "CS331", "CS402", "CS401"]},
{"code": "CS482", "title": "Information and Knowledge Management Systems", "link": "http://bulletin.iit.edu/search/?P=CS%20482", "description": "This capstone course is designed as a project course whose purpose is to enable students to see how the various algorithms and systems they have learned about in their prerequisite courses can be used in context to create useful knowledge management tools.  Class periods will be divided among discussion of design of information and knowledge management systems, lectures on effective project management techniques, and hands-on advising of student project group meetings.", "credits": " 3", "prerequisites:": ["CS425", "CS422", "CS429", "CS425", "CS422", "CS481", "CS425", "CS429", "CS481", "CS425", "CS422", "CS429", "CS425", "CS422", "CS481", "CS425", "CS429", "CS481"]},
{"code": "CS484", "title": "Introduction to Machine Learning", "link": "http://bulletin.iit.edu/search/?P=CS%20484", "description": "An introduction to machine learning concepts and algorithms, including classification, clustering, and regression. Topics include k-means clustering, nearest neighbors classification, decision trees, naive Bayes, logistic regression, support vector machines, and neural networks. Special focus will be on practical aspects of machine learning, including data preparation, experimental design, and modern tools for building machine learning systems. Basic probability theory knowledge is required.", "credits": " 3", "prerequisites:": ["CS151", "CS116", "CS201", "CS401", "CS402", "CS151", "CS116", "CS201", "CS401", "CS402"]},
{"code": "CS485", "title": "Computers and Society", "link": "http://bulletin.iit.edu/search/?P=CS%20485", "description": "Discussion of the impact of computer technology on present and future society. Historical development of the computer. Social issues raised by cybernetics.", "credits": " 3", "prerequisites:": ["CS421", "CS424", "CS425", "CS428", "CS435", "CS421", "CS424", "CS425", "CS428", "CS435"]},
{"code": "CS487", "title": "Software Engineering I", "link": "http://bulletin.iit.edu/search/?P=CS%20487", "description": "Study of the principles and practices of software engineering. Topics include software quality concepts, process models, software requirements analysis, design methodologies, software testing and software maintenance. Hands-on experience building a software system using the waterfall life cycle model. Students work in teams to develop all life cycle deliverables: requirements document, specification and design documents, system code, test plan, and user manuals.", "credits": " 3", "prerequisites:": ["CS331", "CS401", "CS403", "CS425", "CS331", "CS401", "CS403", "CS425"]},
{"code": "CS492", "title": "Introduction to Computer Science Research", "link": "http://bulletin.iit.edu/search/?P=CS%20492", "description": "Prepares undergraduate computer science majors for conducting research.", "credits": " 1", "prerequisites:": []}
]